/***************************************************************************
* Module Operation Explanation
* Replace &name& with the name of the file
* Fills the include, flaged with +include+
* Fills the definition flaged with =====
*
****************************************************************************/

/***************************************************************************
****************************************************************************
*Copyright(c),2008-2028,广州数控设备有限公司
*File name: decode_lexical_analysis.c
*First Author: 
*Date:06/17/2009  
*文件功能描述：
****************************************************************************
****************************************************************************/

#define  DECODE_LEXICAL_ANALYSIS_GLOBALS

/**********************************************************************/
/*Add all #includes here*/
#include "decode_lexical_analysis.h"
/**********************************************************************/

/**********************************************************************/
/*Add all #defines here*/
//decode_lexical_info DecodeLexicalInfoGlobal;
#define D_PRGLEXICALBUF_CNT (1024)  //译码指令缓冲，译码运行时从此缓冲提取指令

typedef struct {//指令解析队列
    decode_instr_parse_info prgLexicalBuf[D_PRGLEXICALBUF_CNT];//指令解析后存储缓冲区
    int readPos;//读位置
    int writePos;//写位置
    int cnt;//当前缓冲数量
}instr_parse_queue;
instr_parse_queue DecodePrgLexicalQueue = {0};
/**********************************************************************/

/**********************************************************************/
/*以下开始函数定义*/
/**********************************************************************/ 
/*函数功能：*/ 
/*输入参数： 参数1：注明输入参数意义及有效性范围*/			
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeTypestructScanfVal(int type, char **str, void *valOft);
int decodeInitLexicalInfo(void)
{
//	int flag = 0;
//	int i, j;
//	int m = 0;

//	for(i=1; i<=DECODE_STR_NAME_LEN; i++){
//		for(j=0; j<INSTR_END_CNT; j++){
//            if((int)strlen(DecodeInstrInfoGlobalTable[j].instrOrg[0].name) == i){
//				if(flag == 0){
//					flag = 1;
//                    DecodeLexicalInfoGlobal.beginPos[i] = m;
//				}
//                DecodeLexicalInfoGlobal.lexicalIndex[m].index = j;
//                strcpy(DecodeLexicalInfoGlobal.lexicalIndex[m].instrName, DecodeInstrInfoGlobalTable[j].instrOrg[0].name);
//				m++;
//			}
//		}
//		if(flag == 1){
//            DecodeLexicalInfoGlobal.endPos[i] = m;
//			flag = 0;
//		}
//	}
//    char varVal[] = {"[[623.736,-1.4,500],[0,0.847722968,-0.530439224,0],[-1,0,-2,0],[0,1,2,3,4,5]];"};
//    char *pStr = varVal;
//    decode_type_data typeData;
//    decode_robtarget *robTarget;
    decodeInitInstrIndexInfo();
    decodeInitTypestructIndexInfo();
//    decodeTypestructScanfVal(D_DATATYPE_ROBTARGET, &pStr, &typeData);
//    robTarget = (decode_robtarget *)&typeData;
	return 1;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_get_lexical_index(char *str)
{
	int pos = strlen(str);
	int i;
	int index = -1;

//    i = DecodeLexicalInfoGlobal.beginPos[pos];
//    for( ; i<DecodeLexicalInfoGlobal.endPos[pos]; i++){
//        if(strcmp(str, DecodeLexicalInfoGlobal.lexicalIndex[i].instrName) == 0){
//            index = DecodeLexicalInfoGlobal.lexicalIndex[i].index;
//			break;
//		}
//	}
	return index;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decode_str_lexical_analysis(char *str[], decode_instr_parse_info *parse_info)
{
    int errFlag = -1;
    char tmpStr[256];
    char pStr = str;
    decode_character_property charPro;

    pStr = decodeGetOneSegment(pStr, tmpStr);

    if (pStr != NULL) {//指令
        if (getOneCharacterIndex(0, tmpStr, &charPro) == 1) {//首次找到
            if (charPro.charType == D_CHAR_TYPE_INSTRUCTION) {//指令，此处需要继续完善，现仅作为测试

            }
        }
    } else {//表达式

    }





//	int i = 1;//除去自身，从1开始
//	int j = 0;
//	int pos;
//	int last_grp = -1;//记录上一次的参数所在的组
//	int opt_mask, grp_mask, type_mask;

//	decode_instruction_info *p_instruction_info;


//	pos = decode_get_lexical_index(str[j++]);

//	if(pos >= 0){
//        p_instruction_info = &DecodeInstrInfoGlobalTable[pos];
//        while(p_instruction_info->instrOrg[i].mask != -1){
//            type_mask = p_instruction_info->instrOrg[i].mask & 0xFF;//变量类型
//            grp_mask = (p_instruction_info->instrOrg[i].mask >> 16) & 0xF;//所在的组
//            opt_mask = (p_instruction_info->instrOrg[i].mask >> 24) & 0xF;//

//			if(opt_mask > 0){//为必选参数
//				if(type_mask){//直接索引界面，察看该类型的变量是否存在
//					//该类型变量不存在，报警退出
//					break;
//				}
//				//如果参数存在，设置指针指向，并设置使用的掩码位
//                parse_info->mark.mask |= 1<<i;//设置为1，表明使用该参数
//				//parse_info->m_mark.m_parg[i] = ;//指针
//				j++;
//			}else{//为可选参数
//				if(last_grp == grp_mask){//可选参数同组，互斥型不能同时出现，因此要报错
//					//添加互斥型可选参数不能同时出现，需要报警
//					break;
//				}
//                if(strncmp(str[j], p_instruction_info->instrOrg[i].name, strlen(p_instruction_info->instrOrg[i].name)) == 0){
//					//如果参数存在，设置指针指向，并设置使用的掩码位，可选参数要从:=后开始
//                    parse_info->mark.mask |= 1<<i;//设置为1，表明使用该参数
//					//parse_info->m_mark.m_parg[i] = ;//指针
//					j++;
//				}
//			}
//			last_grp = grp_mask;
//			i++;
//		}
//	}
	return 0;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
char *decodeGetOneSegment(char *inputStr, char *outputStr)
{
    char *ptr = NULL;
    int cnt = 0;
    int optFlag = 0;//可选参数斜杠标记
    while (*inputStr != 0) {
        if (*inputStr == ' ' || *inputStr == '\t' || *inputStr == ';' || *inputStr == '\n' || *inputStr == ',' || *inputStr == '\\') {//去掉开头的空格
            if (*inputStr == '\\') {
                optFlag = 1;
            }
            inputStr++;
            continue;
        }
        break;
    }
    if (*inputStr == 0) {//表示到末尾
        return NULL;
    }

    if (optFlag == 1) {
        *outputStr = '\\';
        outputStr++;
    }

    while (*inputStr != 0) {
        if (*inputStr == ' ' || *inputStr == '\t' || *inputStr == ';' || *inputStr == '\n' || *inputStr == ',' || *inputStr == '\\') {//去掉开头的空格
            *outputStr = 0;
            if (cnt != 0) {
                ptr = inputStr;
            }
            return ptr;
        }
        *outputStr = *inputStr;
        inputStr++;
        outputStr++;
        cnt++;
    }
    if (cnt != 0) {
        ptr = inputStr;
    }
    return ptr;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeStrSegmentAnalysis(char *outputStr[], char *inputStr)
{
    int i = 0;
    int j = 0;
    int lineType = -1;
    int endFlag = 0;
    char *ptr = NULL;

    while (*inputStr != 0) {
        if (*inputStr == ' ' || *inputStr == '\t') {//去掉开头的空格
            inputStr++;
            continue;
        }
        break;
    }
    ptr = inputStr;
    while (*inputStr != 0) {
        if (*inputStr == ' ' || *inputStr == '\t' || *inputStr == ';') {
            if (j > 0) {
                outputStr[i] = ptr;
                *inputStr = 0;
                j = 0;
                i++;
            }
            if (*inputStr == ';') {
                endFlag = 1;
                *inputStr = 0;
                break;
            }
            continue;

        } else if (*inputStr != '\r' || *inputStr != '\n') {
            if (j == 0) {
                ptr = inputStr;
                j++;
            }
        }
        inputStr++;
    }
    if (endFlag == 0) {//如果没有正确的结束，则报错

    }
    return lineType;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeCheckLineType(char *checkStr)
{
    char *typeStr[] = {//类型判断字符串，要与decode_line_type中的顺序一致，因为返回下标，方便索引
        "NULL",//第一个为空，预留
        "!",
        "MODULE",
        "MODULEEND",
        "PROC",
        "PROCEND",
        "VAR",
        "PERS",
        "CONST",
        "LOCAL",
        "TASK",
        "IF",
        "ELIF",
        "IFEND",
        0,
    };
    int type = 0;
    int i = 0;
    int j = 0;
    char buf[50];

    while (*checkStr == ' ' || *checkStr == '\t') {//去掉空格和制表符
        checkStr++;
    }

    while (*checkStr != 0) {
        if (*checkStr == ' ' || *checkStr == '\t' || *checkStr == ';' || *checkStr == '\r' || *checkStr == '\n') {
            buf[j] = 0;
            while (typeStr[i] != NULL) {
                if (decodeStringCompare(typeStr[i], checkStr, 0) == 0) {//不区分大小写
                    switch (i) {
                    case LINE_TYPE_LOCAL:
                    case LINE_TYPE_TASK:
                        type = i << 16;
                        break;
                    case LINE_TYPE_CONST:
                    case LINE_TYPE_VAR:
                    case LINE_TYPE_PERS:
                        type = type | (i << 8) | LINE_TYPE_DATA;//是为了记录LOCAL和TASK
                        return type;
                        break;
                    case LINE_TYPE_NOTE:
                        type = LINE_TYPE_NOTE;
                        return type;
                        break;
                    default:
                        type = type | (i << 8) | LINE_TYPE_INSTRUCTION;
                        return type;
                        break;
                    }
                    break;
                }
                i++;
            }

            if (type == 0) {//其余指令或表达式
                //此处要添加指令或表达式对比
            }

            while (*checkStr != ' ' && *checkStr != '\t') {//去掉空格和制表符
                checkStr++;
            }
            checkStr--;//此处有必要
            j = 0;
        } else {
            buf[j] = *checkStr;
            j++;
        }
        checkStr++;
    }
#if 0
    while (typeStr[i] != NULL) {
        if (decodeStringCompare(typeStr[i], checkStr, 0) == 0) {//不区分大小写
            type = i;//i就是类型索引
            switch (type) {
            case LINE_TYPE_IF:
            case LINE_TYPE_ELIF:
            case LINE_TYPE_IFEND:
                type = (type << 8) | LINE_TYPE_INSTRUCTION;
                break;
            }

            return type;
        }
        i++;
    }
    if (decodeGetInstructionIndex(checkStr) != -1) {//如果是指令
        type = LINE_TYPE_INSTRUCTION;
    } else if (decodeGetTypestructIndex(checkStr) != -1) {//如果是变量数据
        type = LINE_TYPE_DATA;
    } else if (0) {//如果是表达式运算指令
        type = LINE_TYPE_OPERATION;
    } else if (0) {//如果是子程序调用
        type = LINE_TYPE_SUBCALL;
    } else {
        type = -1;//重新还原
    }
#endif
    //注：例行程序不在此判断，要先压栈后等所有例行程序创建完毕后再判断
    return type;
}
/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeStringCompareEqual(char *srcStr, char *desStr, int len)
{
    int result = 0;
    int i = 0;
    int val;

    while (i < len) {
        if (*srcStr != 0 && *desStr != 0){
            val = abs(*srcStr - *desStr);
            if (val != 0 && val != 32) {//大小写
                return result;
            }
        } else {
            return result;
        }
        srcStr++;
        desStr++;
        i++;
    }
    result = 1;

    return result;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeStringCompare(const char *srcStr, const char *desStr, int len)
{
    int i = 0;
    int val;

    while (*srcStr != 0 && *desStr != 0) {
        val = abs(*srcStr - *desStr);
        if (val != 0 && val != 32) {//大小写
            return *srcStr - *desStr;//返回大小，大于0则大，小于0则小
        }
        srcStr++;
        desStr++;
        i++;
        if (len > 0) {
            if (i == len) {
                return 0;
            }
        }
    }
    if (*srcStr != 0) {
        return 1;
    } else if (*desStr != 0) {
        return -1;
    }

    return 0;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeLineStringLexicalAnalysis(char *str)//此处str会被修改
{
    int i = 0;
    int j;
    int lineType;
    int spaceCnt = 0;//空格次数
    char segmen[20];//临时存储字段

    char *srcPtr = str;
    char *desPtr = str;

    while (*srcPtr == ' ' || *srcPtr == '\t') {
        srcPtr++;
    }

    while (*srcPtr != 0) {
        if (*srcPtr == ' ' || *srcPtr == '\t') {
            lineType = decodeCheckLineType(segmen);//因为desPtr已经设为0，所以是一个字符串
            if (lineType == LINE_TYPE_LOCAL || lineType == LINE_TYPE_TASK) {

            } else {

            }
            spaceCnt++;
            if (spaceCnt > 0) {
                break;
            }
        } else {
            *desPtr = *srcPtr;
            segmen[i] = *srcPtr;
            i++;
            desPtr++;
        }

        srcPtr++;
    }

}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
decode_instr_parse_info *decodeMallocInstructParseInfoBuf(void)
{
    int pos;

    if (DecodePrgLexicalQueue.cnt != D_PRGLEXICALBUF_CNT) {//注意此处要添加互斥访问
        pos = DecodePrgLexicalQueue.writePos;
        DecodePrgLexicalQueue.writePos = (DecodePrgLexicalQueue.writePos + 1) % D_PRGLEXICALBUF_CNT;
        DecodePrgLexicalQueue.cnt++;
        memset(&DecodePrgLexicalQueue.prgLexicalBuf[pos].instrData, 0xFF, sizeof(decode_instruction_data));//全部初始化为-1
        return &DecodePrgLexicalQueue.prgLexicalBuf[pos];
    }
    return NULL;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/
int decodeReadInstructParseInfoBuf(decode_instr_parse_info *instrParseInfo)
{
    int errFlag = -1;

    if (DecodePrgLexicalQueue.cnt > 0) {//注意此处要添加互斥访问
        *instrParseInfo = DecodePrgLexicalQueue.prgLexicalBuf[DecodePrgLexicalQueue.readPos];
        DecodePrgLexicalQueue.readPos = (DecodePrgLexicalQueue.readPos + 1) % D_PRGLEXICALBUF_CNT;
        DecodePrgLexicalQueue.cnt--;
        errFlag = 1;
    }
    return errFlag;
}

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

/**********************************************************************/
/*函数功能：*/
/*输入参数： 参数1：注明输入参数意义及有效性范围*/
/*输出参数: 	  参数1：注明输出参数意义及有效性范围*/
/*返回值：	  返回值范围及意义*/
/***********************************************************************/
/**********************************************************************/
/*函数实现原理：请注明获取输出参数的方法*/
/**********************************************************************/

/**********************************************************************/

